# parameters
nc: 6 # number of classes
depth_multiple: 1.0 # model depth multiple
width_multiple: 1.0 # layer channel multiple
anchors:
  - [12, 16, 19, 36, 40, 28] # P3/8
  - [36, 75, 76, 55, 72, 146] # P4/16
  - [142, 110, 192, 243, 459, 401] # P5/32

# yolov7 backbone
backbone:
  # [from, number, module, args]
  [
    [-1, 1, stem, [32, "ReLU6"]], # 0-P1/2
    [-1, 1, MBConvBlock, [64, 3, 1, 1, 0]], # 1
    [-1, 1, MBConvBlock, [64, 3, 2, 6, 0.028, True]], # 2-P2/4
    [-1, 1, MBConvBlock, [128, 3, 1, 6, 0.057]],  # 3
    [-1, 1, MBConvBlock, [256, 5, 2, 6, 0.085]], # 4-P3/8
    [-1, 1, MBConvBlock, [256, 5, 1, 6, 0.114]],

    [-1, 1, Conv, [128, 3, 2]],  
    [-1, 1, Conv, [64, 1, 1]],
    [-2, 1, Conv, [64, 1, 1]],
    [-1, 1, Conv, [64, 3, 1]],
    [-1, 1, Conv, [64, 3, 1]],
    [-1, 1, Conv, [64, 3, 1]],
    [-1, 1, Conv, [64, 3, 1]],
    [[-1, -3, -5, -6], 1, Concat, [1]],
    [-1, 1, Conv, [256, 1, 1]],     # 14

    [-1, 1, CoordAtt, [256, 256]],  # 15

    [-1, 1, MP, []],
    [-1, 1, Conv, [128, 1, 1]],
    [-3, 1, Conv, [128, 1, 1]],
    [-1, 1, Conv, [128, 3, 2]],
    [[-1, -3], 1, Concat, [1]],   # 20

    [-1, 1, Conv, [128, 1, 1]],
    [-2, 1, Conv, [128, 1, 1]],
    [-1, 1, Conv, [128, 3, 1]],
    [-1, 1, Conv, [128, 3, 1]],
    [-1, 1, Conv, [128, 3, 1]],
    [-1, 1, Conv, [128, 3, 1]],
    [[-1, -3, -5, -6], 1, Concat, [1]],
    [-1, 1, Conv, [512, 1, 1]],  # 28

    [-1, 1, CoordAtt, [512, 512]],  # 29

    [-1, 1, MP, []],
    [-1, 1, Conv, [256, 1, 1]],
    [-3, 1, Conv, [256, 1, 1]],
    [-1, 1, Conv, [256, 3, 2]],
    [[-1, -3], 1, Concat, [1]],  # 34

    [-1, 1, Conv, [256, 1, 1]],
    [-2, 1, Conv, [256, 1, 1]],
    [-1, 1, Conv, [256, 3, 1]],
    [-1, 1, Conv, [256, 3, 1]],
    [-1, 1, Conv, [256, 3, 1]],
    [-1, 1, Conv, [256, 3, 1]],
    [[-1, -3, -5, -6], 1, Concat, [1]],
    [-1, 1, Conv, [1024, 1, 1]],  # 42

    [-1, 1, CoordAtt, [1024, 1024]],  # 43
  ]

# yolov7 head
head:
  [[-1, 1, SPPCSPC, [512]], # 44
  
   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [29, 1, Conv, [256, 1, 1]], # route backbone P4
   [[-1, -2], 1, BiFPN_Add2, [256, 256]],  # 48
   
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], # 56
   
   [-1, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [15, 1, Conv, [128, 1, 1]], # route backbone P3
   [[-1, -2], 1, BiFPN_Add2, [128, 128]],  # 60
   
   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1]], # 68
      
   [-1, 1, MP, []],
   [-1, 1, DepthWiseConv, [128]],
   [-3, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 2]],
   [-5, 1, Conv, [512, 3, 2]],
   [[-1, -2, -4, 56], 1, Concat, [1]],  # 74
   [-1, 1, Conv, [512, 1, 1]],  # 75
   
   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]], # 83
      
   [-1, 1, MP, []],
   [-1, 1, DepthWiseConv, [256]],
   [-3, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 2]],
   [-5, 1, Conv, [1024, 3, 2]],
   [[-1, -2, -4, 44], 1, Concat , [1]],  # 89
   [-1, 1, Conv, [1024, 1, 1]], # 90
   
   [-1, 1, Conv, [512, 1, 1]],
   [-2, 1, Conv, [512, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -2, -3, -4, -5, -6], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]], # 98
   
   [68, 1, RepConv, [256, 3, 1]], 
   [83, 1, RepConv, [512, 3, 1]],
   [98, 1, RepConv, [1024, 3, 1]],

   [[99, 100, 101], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
